{
    "Key-Words": [
        "..",
        "data",
        "sample",
        "raw"
    ],
    "content": "PROJEKTNAME\nProjektcharta\nVersion 0.x\nLetzte Änderung: 11.12.2022\nBeschreibung der Problemstellung\nFormulieren Sie die Problemstellung und wichtige Informationen zur Domäne und/oder dem Geschäftsbereich, in der das Produkt entwickelt werden soll.\nDazu gehört auch eine Zusammenfassung der wichtigsten Erkenntnisse aus der Nutzer:innen-Analyse: Relevante Segmente und Nutzergruppen. Beschreiben Sie die Probleme und Bedürfnisse der Nutzer:innen des zu entwickelnden Produktes. \nStakeholder: Listen Sie beteiligte und betroffene Personen des Projektes auf. Beschreiben Sie deren Ziele und Beziehungen untereinander. \nDetailanalysen wie einzelne «Personas» oder Interviews können Sie in separaten Dokumenten als Anhang aufführen.\nSituationsbewertung\nIn der Situationsbewertung werden zur Verfügung stehende Ressourcen (Personal, Material, (Software-)Tools, Infrastruktur, …) und Zeit, sowie Einschränkungen und Randbedingungen (Constraints) erfasst. Zudem sind mögliche Risiken, die während des Projektes auftreten können, zu identifizieren.\nProjektziele und Erfolgskriterien\nWann ist das Projekt erfolgreich: Formulieren Sie richtungsweisende Ziele des Projektes, wo immer möglich darauf abgestimmte Kennzahlen und die zu erreichenden Zielwerte.\nZudem ist es oft hilfreich zu benennen, was explizit von den Projektzielen ausgeschlossen wird (Out of Scope).\nDatenanalyse-Ziele\nDatenanalyse- und Modellierungsaufgaben mit entsprechenden Kenngrössen und deren Zielwerte.  (Absprache mit Team)\nProjektphasen und Zeitplan\nUnterteilen Sie das Projekt in einzelne Phasen, beschreiben Sie diese kurz und erstellen Sie einen groben Zeitplan.\nRollen und Kontaktdaten\nListen Sie hier die in der Entwicklungsarbeit involvierten Personen mit ihren Rollenbezeichnungen, Aufgaben und Kontaktdaten auf\n\nKollaborationsmodus\nIn welcher Form und Frequenz werden Informationen und Ergebnisse innerhalb des Entwicklungsteams, mit den auftraggebenden Personen und anderen Anspruchsgruppen ausgetauscht?\nRessourcen und Tools\nVorläufige Auswahl der in der Umsetzung eingeplanten Ressourcen und Tools.\n\n"
}