[{
  "_id": {
    "$oid": "67e550fed4cff5e2b4e67a3b"
  },
  "filename": "C:\\Users\\damia\\OneDrive\\Documents\\Studium_Weiterbildung\\ZHAW_Zuercher_Hochschuele_fuer_angewandte_Wissenschaften\\Bachlor_Data_Science\\Module\\Informatikrecht\\Lectures\\240916, ZHAW, ITR-HS24-EINFÜHRUNG, Mf.pdf",
  "Key-Words": [
    "Informatikrecht",
    "Lectures",
    "240916, ZHAW, ITR-HS24-EINFÜHRUNG, Mf.pdf"
  ],
  "language": "en",
  "content": "INFORMATIKRECHT (T.BA.XX.ITR.23.HS) HS 2024 Introduction Computer Science Law PROCEDURES ▸Why right? ▸Right order at different angles ▸Essentials Civil, Criminal, Administrative Procedures ▸Your TakeAway\nINTRODUCTION IN THE MODULABLAUF “Objective: Know & understand elementary legal relationships in the IT context. You should know different types of contract & typical stumbling stones. Knowing the principles of data protection and liability law and applying concrete questions. ▸Written open book Modulendprüfung, 90 min. ▸2 ECTS-CreditsTHEMENFELDER DIESES MODULES▸Legal Framework/Introduction ▸Different types of IT contracts ▸Privacy/Data Protection ▲Informatics/Information Security from Legal View ▸Social Media ▸IP-Laws\nWHY - WESHALB RECHT?▸Social Framework (Orientation saves energy) ▸Power control ▸ Conflict management ▸Provides freedoms ‹provides framework for social integration ‹ creates the same framework conditions for all market participants ‹legitimate actions of state bodies such as authorities or courts ‹forces everyone to express their will precisely ‹. not a narrow (sometimes but already...) framework, but only specifies “social” desired behaviors. Within the legal framework, the parties (private) are largely free to move freely technologically and economically. ▸New technologies demand new - democratically negotiated - rules. ▸Examples: KI/ML, semi-autonomous driving cars (level 3), drones, IoT, medical technology, radio standard 5G, blockchain etc. DEVELOPMENT OF “RECHT” IN A TECHNICAL UMFELD (2)ñ Right as a framework of the admissible (= maximum) or the legally required (= minimum) within a (social) system. ▸Clarification of obligations (what), responsibilities (who) and liability for the incorrect performance of contracts. ▸Liability also for damages which cause technical systems (e.g. faulty control software. AI?). ▸Industrial standards/best practices (e.g. ISO standards) are widespread and sensible, but they complement “only” the right. ▸ Contractual agreements are considered here as “right”! (make your own law!)\nRECHT ALS “RISK MANAGEMENT” (To “handle” risks, it makes sense to take both technical (security by design) organizational and legal measures! (Compliance). ▸Get legal support as early as possible! Otherwise, projects can be shot at the last minute! ▸The management is personally responsible for organizing and controlling compliance with legal regulations (Compliance=document obligations)! ZENTRALE, (OBLIGATIONS-)RIGHT QUESTION1. WER wants two. by WEM 3. WAS 4. WORAUS? ▸In the specific case, further legal questions regularly arise in these questions, which can often not be answered unambiguously (digitally with yes/no)... overcrowding, socially desired behaviors ▸Right has to adapt to changing behaviors. Current question: what guidelines do we want to give to the AI? (EU: new AI Regulation) ▸Current liabilities are to be requested in a diverse, open community for all (the largest common denominator), i.e. it serves for integration. Not only for “Ausländer”, but also for such companies!SITTE, MORAL & RECHTSITTE & MORAL RECHTCurrent area of law Sitte MoralNot part of law (field of social discourses and conflictsNot part of morality and morality (for practical reasons)But: there is no more “a morality” & a “moral”, but many morals & morals! What is “right & wrong” must be renegotiated again and again! Many politicians have not yet understood this...JURISTIC ARGUMENTATIONX = \"(Art. XXX) + (Note YYY) Claim (X) is based on (legal article) and necessary evidence YYY. or based on (legal article) and necessary evidence YYY concludes. (powers engineers i.d.R. no problems) GENERAL RECOGNITIONOn the federal, cantonal and municipal level, there are three independent institutions: ▸LEGISLATIVE (Parliaments & citizens) ▸EXEKUTIVE (administrative) ▸JUDIKATIVE (administrative) Each of these authorities controls and balances the power of the other two (“check & balance”) - actually... Bsp.: Security guarantees for banks & electricity companies, investments in basic research etc.RECHTSORDNUNG INDUSTRIAL BLICKWINKELNEindividement according to: the Swiss Confederation” (Art. 1 BV) – not vice versa! ▸The Swiss Confederation is a federal state. It consists of 26 largely sovereign states that give themselves their own organization & constitution (e.g. Art. 1 Constitution ZH: “The Canton of Zurich is a sovereign state of the Swiss Confederation.” ‘Art. 1 Constitution Zurich: “4 The canton recognises the independence of the municipalities.” Municipalities are free to organise themselves and to adopt rules in their municipality. ▸Bund (resp. Cantons and every community!) may only issue laws and act in a legal area if there is a constitutional legitimation! ▸Kantone are above the federal government in the legislative power! Cantons over the municipalities. HERE OF THE RECHTS (BUND, KANTONE, COMMUNITY)\nConstitutional lawsNB: Regulation ≠official!PRIVAT/ÖFFENTISCHE RECHT\nPrivate lawpublic.Law\n- OR/ZGB - GeBüV - DSG - URG, UWG u.a.m.- StGB - FMG - BÜPF/VÜPF - ElDI-V u.a.m.PRIVAT-/ÖFFENTlichen RECHT▸Privatrecht is governed, inter alia, by the principle of coalition and contract freedom, public law against the legality principle (= violence control). ▸= completely different jurisdiction (Zivil-/Verwaltungsgericht) with different process sequences and process rights!RECHTSBEGRIFFE▸Forced, agreed and dispositive law ▸Presumption of good faith (ZGB 2) ▸Trade according to trust and belief (ZGB 2) ▸Rightly discretion (ZGB 4) ▸Construction burden (ZGB 8) ▸Various economic links abroad. In addition to international law, (bi-/multilateral) international treaties, the IPRG (law on international private law) is the main interface between Swiss and foreign law. ▸IPRG regulates when which right (CH or abroad) is applicable and which judges should be responsible. ▸For economic & practical reasons, we are forced to adopt EU law voluntarily. Often, however, the adjustment takes place in such a way that the economy has to make as few changes as possible & economic advantages over the EU arise (e.g. revDSG / GDPR).INSTANZENZUG▸It is not enough to know what rights you have, you also need to know how to enforce it! ▸Civil, administrative and criminal courts have largely different procedures! ▸In general, however, in all legal areas, three instances: District Court – Cantonal Court – BundesgerichtsESSENTIALS ZIVILPROZESS No process without payment! ▸In civil proceedings, the plaintiff must prove the claim – the court does not seek evidence! ▸Whoever loses the civil process must take over the judicial costs and party costs of the other side! ▸Whoever wins a receivable process does not yet have the money...ESSENTIALS STRAFVERFAHREN▸Procedures are regulated in StGB & StPO. Police are mostly subject to cantonal sovereignty & is regulated there. ▸Overall jurisdiction is the place of action or success. ▸ For applications, a period of 3 months applies! ▸ Prosecutor (StA) conducts investigation, has to collect stressful & unloading aspects. Apart from being a “private criminal prosecutor”! ▸StA introduces either method, punishes (max. 6 months of imprisonment and/or 180 daily rates) or assigns the case for assessment to the Criminal ESSENTIALS ADMINISTRATIVE PROCEDURES Otherwise the order is void! ▸Consequently always reconsideration/consultation against the order possible when new facts appear! Years later! ▸Proposal for a Council Directive on the approximation of the laws of the Member States relating to cosmetic products complaint within 10/20/30 days. According to the legal basis, cantonal upper court or federal court is supreme. Against violation of constitutional rights always Bundesgericht.WAS NEHME ICH VON HEUTE MIT? ▸... ▸...",
  "translated": true
}]